[M_Sage_PallingAround MissionDefinition]
MissionDescription="Sir Hammerlock has found an armored bullymong hiding in [place]Hunter's Grotto[-place]. As you are a courageous slayer of creatures, he assumed you might wish to track him down."
MissionSummary="Kill the bulletproof bullymong."
TeaserText="Being the tale of an armored bullymong and a well-armed Vault Hunter."

[M_Sage_PallingAround:KillCreatureSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has found an armored bullymong hiding in [place]Hunter's Grotto[-place]. As you are a courageous slayer of creatures, he assumed you might wish to track him down.<br><br>As the bullymong turtles up whenever you get close to it, he has suggested that you keep your distance before engaging it."
